Revit 2026 API

# ScheduleFieldGetCustomFieldData Method

---

Gets the data associated with this custom field. If this field isn't a CustomField will return .

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CustomFieldData GetCustomFieldData()
```
```vb
Public Function GetCustomFieldData As CustomFieldData
```
```cpp
public:
CustomFieldData^ GetCustomFieldData()
```
```fsharp
member GetCustomFieldData : unit -> CustomFieldData
```

#### Return Value

CustomFieldData Returns the data associated with this custom field. If this field isn't a CustomField will return .

#### Reference

ScheduleField Class

Autodesk.Revit.DB Namespace